Revit 2026 API

# DimensionOrigin Property

---

The dimension origin.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; }
```
```vb
Public ReadOnly Property Origin As XYZ
	Get
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```
```fsharp
member Origin : XYZ with get
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when: |

  * SpotDimension has more than one segments.

The origin is the middle point of the dimension line that makes up the dimension. This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding property of the DimensionSegment class.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace